InformationRegisters/НастройкиПодбораПерсонала.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПодбораПерсонала</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УдалитьИспользоватьПодборПерсонала</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьСогласованиеВакансий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьЗаявкиНаПодборПерсонала</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОткрытиеВакансииТребуетСогласования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьПоискКандидатовНаИнтернетСайтах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьОценкуЭффективностиИсточниковИнформацииОКандидатах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроверятьКандидатовЗадержавшихсяНаОдномЭтапе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДнейДоСообщения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДнейДоОтклонения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаАвтоматическогоОтклонения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтклоненияКандидатов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодРаботыСВакансией</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмеренияПериодаРаботыСВакансией</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПутьККаталогуMuPDF</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьСервисСемантическогоАнализа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьИспользоватьСкрытиеПерсональныхДанныхКандидатов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТекущиеЭтапыРаботыСКандидатами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ТекущиеЭтапыРаботыСКандидатами</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЭтапРаботы</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЭтапРаботыСКандидатами</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияЭтаповРаботыСКандидатами</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Кандидат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кандидаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СостоянияСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СостоянияСогласования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рассматривается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласовано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Готовится</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапланированоОбучение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЭтапыРаботыСКандидатами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ЭтапыРаботыСКандидатами</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Утверждение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РешениеОПриемеНаРаботу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемНаРаботу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РассмотрениеОтклика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаботаЗавершена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособыОпределенияЗадержкиКандидатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СпособыОпределенияЗадержкиКандидатов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КакЗаданоВНастройках</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КакЗаданоВЭтапе</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ПодборПерсоналаПроверки/Ext/Module.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// См. СтандартныеПодсистемыСервер.ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод
Процедура ПриОпределенииМетодовРазрешенныхДляВызоваКакПроизвольныйКод(Методы) Экспорт
	Методы.Вставить("ПроверкаНаличияДублейЛичныхДанныхКандидатов");
	Методы.Вставить("ПроверкаНаличияЗадержавшихсяКандидатов");
	Методы.Вставить("ПриНачальномЗаполненииДанныхКонтроляЗадержкиКандидатов");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Процедура выполняет начальное заполнение данных контроля задержки кандидатов
//
// Параметры:
//  ПараметрыОбновления  - Структура - описывает текущие параметры обновления
//
Процедура ПриНачальномЗаполненииДанныхКонтроляЗадержкиКандидатов(ПараметрыОбновления) Экспорт
	
	НастройкиПодбораПерсонала = РегистрыСведений.НастройкиПодбораПерсонала.ЗначенияНастроек();
	Если НастройкиПодбораПерсонала.ПричинаАвтоматическогоОтклонения <> Справочники.ПричиныОтклоненияКандидатов.ПустаяСсылка()
	 Или Не Справочники.ПричиныОтклоненияКандидатов.ПричинаОтклоненияСуществует(НСтр("ru = 'Задержка на этапе'")) Тогда
		ПараметрыОбновления.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	
	ПараметрыОбновления.ОбработкаЗавершена = Ложь;
	
	НачатьТранзакцию();
	Попытка
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Справочник.ПричиныОтклоненияКандидатов");
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.НастройкиПодбораПерсонала");
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		ПричинаОтклонения = Справочники.ПричиныОтклоненияКандидатов.ДобавитьПричинуОтклоненияКандидатов(НСтр("ru = 'Задержка на этапе'"));
		НастройкиПодбораПерсонала.ДнейДоСообщения = 30;
		НастройкиПодбораПерсонала.ДнейДоОтклонения = 60;
		НастройкиПодбораПерсонала.ПричинаАвтоматическогоОтклонения = ПричинаОтклонения.Ссылка;
		РегистрыСведений.НастройкиПодбораПерсонала.УстановитьНастройки(НастройкиПодбораПерсонала);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	ПараметрыОбновления.ОбработкаЗавершена = Истина;
	
КонецПроцедуры

Процедура ПроверкаНаличияЗадержавшихсяКандидатов(Проверка, ПараметрыПроверки) Экспорт
	
	ПроверятьКандидатовЗадержавшихсяНаОдномЭтапе = ПолучитьФункциональнуюОпцию("ПроверятьКандидатовЗадержавшихсяНаОдномЭтапе");
	Если Не ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.КонтрольВеденияУчета") ИЛИ Не ПроверятьКандидатовЗадержавшихсяНаОдномЭтапе Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	СпособВыявленияЗадержавшихсяКандидатов = СпособыВыявленияЗадержавшихсяКандидатов().Предупреждение;
	ЗадержавшиесяКандидаты = РезультатПроверкиНаличияЗадержавшихсяКандидатов(СпособВыявленияЗадержавшихсяКандидатов);
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ЗадержавшиесяКандидаты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ЗадержавшийсяКандидат Из ЗадержавшиесяКандидаты Цикл
		МодульКонтрольВеденияУчета = ОбщегоНазначения.ОбщийМодуль("КонтрольВеденияУчета");
		Проблема = МодульКонтрольВеденияУчета.ОписаниеПроблемы(ЗадержавшийсяКандидат.Кандидат, ПараметрыПроверки);
		Проблема.ВажностьПроблемы = Перечисления["ВажностьПроблемыУчета"].Предупреждение;
		ДнейДоСообщения = ЗарплатаКадрыКлиентСервер.ПредставлениеПоПериодичности(ЗадержавшийсяКандидат.ДнейДоступно,
			Перечисления.Периодичность.День);
		Проблема.УточнениеПроблемы = СтрШаблон(НСтр("ru = 'Кандидат без движения более %1.
			|Продолжите работу с кандидатом или отклоните его, если работа в действительности завершена.'"),
			ДнейДоСообщения);
		УстановитьПривилегированныйРежим(Истина);
		КонтрольВеденияУчетаБЗК.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
		УстановитьПривилегированныйРежим(Ложь);
	КонецЦикла;
	
КонецПроцедуры

// Возвращает массив задержавшихся кандидатов
//
// Параметры:
//  СпособВыявленияЗадержавшихсяКандидатов - Строка - вариант из СпособВыявленияЗадержавшихсяКандидатов().
// 
// Возвращаемое значение:
//  ЗадержавшиесяКандидаты - Массив - массив задержавшихся кандидатов
//
Функция ЗадержавшиесяКандидаты(СпособВыявленияЗадержавшихсяКандидатов) Экспорт
	
	ЗадержавшиесяКандидаты = РезультатПроверкиНаличияЗадержавшихсяКандидатов(СпособВыявленияЗадержавшихсяКандидатов);
	ЗадержавшиесяКандидаты = ЗадержавшиесяКандидаты.ВыгрузитьКолонку("Кандидат");
	
	Возврат ЗадержавшиесяКандидаты;
	
КонецФункции

Функция СпособыВыявленияЗадержавшихсяКандидатов() Экспорт
	
	Варианты = Новый Структура();
	Варианты.Вставить("Предупреждение", "Предупреждение");
	Варианты.Вставить("Отклонение", "Отклонение");
	
	Возврат Варианты;
	
КонецФункции

// Параметры:
//  Проверка - СправочникСсылка.ПравилаПроверкиУчета
//  ПараметрыПроверки - см. КонтрольВеденияУчета.ОписаниеПроблемы.ПараметрыПроверки
Процедура ПроверкаНаличияДублейЛичныхДанныхКандидатов(Проверка, ПараметрыПроверки) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ДанныеДублей = Обработки.ОбъединениеДублейПерсональныхДанных.ТаблицаДублей(
		Тип("СправочникСсылка.ЛичныеДанныеКандидатов"));
	Дубли = ОбщегоНазначения.ВыгрузитьКолонку(ДанныеДублей, "Дубль", Истина);
	КандидатыДублей = ПодборПерсонала.КандидатыПоЛичнымДаннымКандидатов(Дубли, Ложь);
	
	Для Каждого Дубль Из Дубли Цикл
		СовпадающиеДанные = ДанныеДублей.НайтиСтроки(Новый Структура("Дубль", Дубль));
		Кандидаты = КандидатыДублей.НайтиСтроки(Новый Структура("ЛичныеДанныеКандидата", Дубль));
		
		ПараметрыВыполненияПроверки = КонтрольВеденияУчета.ПараметрыВыполненияПроверки(
			НСтр("ru = 'Проверка дублей личных данных кандидатов'"),
			ЗначенияИзКолонкиСовпадающихДанныхСтрокой(СовпадающиеДанные, "ОбластьПоиска"),
			ЗначенияИзКолонкиСовпадающихДанныхСтрокой(СовпадающиеДанные, "Значение"));
		КонтрольВеденияУчета.ОчиститьРезультатыПредыдущихПроверок(Проверка, ПараметрыВыполненияПроверки);
		
		ВидПроверки = КонтрольВеденияУчета.ВидПроверки(ПараметрыВыполненияПроверки);
		
		Для Каждого СтрокаКандидата Из Кандидаты Цикл
			МодульКонтрольВеденияУчета = ОбщегоНазначения.ОбщийМодуль("КонтрольВеденияУчета");
			Проблема = МодульКонтрольВеденияУчета.ОписаниеПроблемы(СтрокаКандидата.Кандидат, ПараметрыПроверки);
			Проблема.ВидПроверки = ВидПроверки;
			Проблема.ВажностьПроблемы = ВажностьПроблемыДублей(СовпадающиеДанные);
			Проблема.УточнениеПроблемы = УточнениеПроблемыДублейЛичныхДанныхКандидата(СовпадающиеДанные);
			КонтрольВеденияУчетаБЗК.ЗаписатьПроблему(Проблема, ПараметрыПроверки);
		КонецЦикла;
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Возвращаемое значение:
//  Строка
Функция ИдентификаторГруппыПроверокКонтрольПодбораПерсонала() Экспорт
	
	Возврат "КонтрольПодбораПерсонала";
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция РезультатПроверкиНаличияЗадержавшихсяКандидатов(СпособВыявленияЗадержавшихсяКандидатов)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТекущиеЭтапыРаботыСКандидатами.Кандидат КАК Кандидат,
		|	ТекущиеЭтапыРаботыСКандидатами.ЭтапРаботы КАК ЭтапРаботы,
		|	ТекущиеЭтапыРаботыСКандидатами.ДатаВремя КАК ДатаЭтапа
		|ИЗ
		|	РегистрСведений.ТекущиеЭтапыРаботыСКандидатами КАК ТекущиеЭтапыРаботыСКандидатами
		|ГДЕ
		|	ТекущиеЭтапыРаботыСКандидатами.Кандидат.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияСогласования.Отклонено)
		|	И ТекущиеЭтапыРаботыСКандидатами.ЭтапРаботы <> ЗНАЧЕНИЕ(Перечисление.ЭтапыРаботыСКандидатами.РаботаЗавершена)
		|	И ТекущиеЭтапыРаботыСКандидатами.ДатаВремя <> ДАТАВРЕМЯ(1, 1, 1)";
	
	ЗадержавшиесяКандидаты = Новый ТаблицаЗначений;
	ЗадержавшиесяКандидаты.Колонки.Добавить("Кандидат", Новый ОписаниеТипов("СправочникСсылка.Кандидаты"));
	ЗадержавшиесяКандидаты.Колонки.Добавить("ДнейДоступно", Новый ОписаниеТипов("Число"));
	
	СпособыВыявленияЗадержавшихсяКандидатов = СпособыВыявленияЗадержавшихсяКандидатов();
	НастройкиПодбораПерсонала = РегистрыСведений.НастройкиПодбораПерсонала.ЗначенияНастроек();
	ДанныеЗадержкиПоЭтапам = ДанныеЗадержкиПоЭтапам(СпособВыявленияЗадержавшихсяКандидатов);
	Выборка = Запрос.Выполнить().Выбрать();
	ТекущаяДата = ТекущаяДатаСеанса();
	Если СпособВыявленияЗадержавшихсяКандидатов = СпособыВыявленияЗадержавшихсяКандидатов.Отклонение Тогда
		ДнейДоступно = НастройкиПодбораПерсонала.ДнейДоОтклонения;
		ЗаполнитьКандидатовДляОтклонения(ЗадержавшиесяКандидаты, ДанныеЗадержкиПоЭтапам, Выборка, ДнейДоступно, ТекущаяДата);
	ИначеЕсли СпособВыявленияЗадержавшихсяКандидатов = СпособыВыявленияЗадержавшихсяКандидатов.Предупреждение Тогда
		ДнейДоступно = НастройкиПодбораПерсонала.ДнейДоСообщения;
		ЗаполнитьКандидатовДляПредупреждения(ЗадержавшиесяКандидаты, ДанныеЗадержкиПоЭтапам, Выборка, ДнейДоступно, ТекущаяДата);
	Иначе
		ВызватьИсключение НСтр("ru = 'Способ выявления задержавшихся кандидатов не определен'");
	КонецЕсли;
		
	Возврат ЗадержавшиесяКандидаты;
	
КонецФункции

Функция ДанныеЗадержкиПоЭтапам(СпособВыявленияЗадержавшихсяКандидатов) Экспорт
	
	Запрос = Новый Запрос;
	СхемаЗапроса = Новый СхемаЗапроса;
	ОписаниеЗапроса = СхемаЗапроса.ПакетЗапросов[0];
	ОператорСхемы = ОписаниеЗапроса.Операторы[0];
	ВыбираемыеПоля = ОператорСхемы.ВыбираемыеПоля;
	
	ОператорСхемы.Источники.Добавить("Справочник.ЭтапыРаботыСкандидатами", "ЭтапыРаботыСкандидатами");
	ВыбираемыеПоля = СхемаЗапроса.ПакетЗапросов[0].Операторы[0].ВыбираемыеПоля;
	ВыбираемыеПоля.Добавить("ЭтапыРаботыСкандидатами.Ссылка");
	
	СпособыВыявленияЗадержавшихсяКандидатов = СпособыВыявленияЗадержавшихсяКандидатов();
	Если СпособВыявленияЗадержавшихсяКандидатов = СпособыВыявленияЗадержавшихсяКандидатов.Отклонение Тогда
		ВыбираемыеПоля.Добавить("ЭтапыРаботыСкандидатами.ОтклонятьЗадержавшихсяКандидатов");
		ВыбираемыеПоля.Добавить("ЭтапыРаботыСкандидатами.СпособОтклоненияЗадержавшихсяКандидатов");
		ВыбираемыеПоля.Добавить("ЭтапыРаботыСкандидатами.ДнейДоОтклонения");
	ИначеЕсли СпособВыявленияЗадержавшихсяКандидатов = СпособыВыявленияЗадержавшихсяКандидатов.Предупреждение Тогда
		ВыбираемыеПоля.Добавить("ЭтапыРаботыСкандидатами.ПроверятьКандидатовНаЗадержку");
		ВыбираемыеПоля.Добавить("ЭтапыРаботыСкандидатами.СпособПроверкиКандидатовНаЗадержку");
		ВыбираемыеПоля.Добавить("ЭтапыРаботыСкандидатами.ДнейДоСообщения");
	КонецЕсли;
	
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ЭтапыБезОтклонения()
	
	ЭтапыБезОтклонения = Новый Массив;
	ЭтапыБезОтклонения.Добавить(Перечисления.ЭтапыРаботыСКандидатами.РешениеОПриемеНаРаботу);
	ЭтапыБезОтклонения.Добавить(Перечисления.ЭтапыРаботыСКандидатами.ПриемНаРаботу);
	ЭтапыБезОтклонения.Добавить();
	
	Возврат ЭтапыБезОтклонения
	
КонецФункции

Процедура ЗаполнитьКандидатовДляОтклонения(ЗадержавшиесяКандидаты, ДанныеЗадержкиПоЭтапам, Выборка, ДнейДоступно, ТекущаяДата)
	
	ЭтапыБезОтклонения = ЭтапыБезОтклонения();
	Пока Выборка.СледующийПоЗначениюПоля("Кандидат") Цикл
		Если ТипЗнч(Выборка.ЭтапРаботы) = Тип("СправочникСсылка.ЭтапыРаботыСкандидатами") Тогда
			ДанныеЗадержкиПоЭтапу = ДанныеЗадержкиПоЭтапам.НайтиСтроки(Новый Структура("Ссылка", Выборка.ЭтапРаботы));
			Если ДанныеЗадержкиПоЭтапу.Количество() = 0 Или Не ДанныеЗадержкиПоЭтапу[0].ОтклонятьЗадержавшихсяКандидатов Тогда
				Продолжить;
			ИначеЕсли ДанныеЗадержкиПоЭтапу[0].СпособОтклоненияЗадержавшихсяКандидатов =
				Перечисления.СпособыОпределенияЗадержкиКандидатов.КакЗаданоВЭтапе Тогда
				ДнейДоступно = ДанныеЗадержкиПоЭтапу[0].ДнейДоОтклонения;
			КонецЕсли;
		Иначе
			Если ЭтапыБезОтклонения.Найти(Выборка.ЭтапРаботы) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		Если (НачалоДня(ТекущаяДата) - НачалоДня(Выборка.ДатаЭтапа)) / (60 * 60 * 24) > ДнейДоступно Тогда
			ЗадержавшийсяКандидат = ЗадержавшиесяКандидаты.Добавить();
			ЗадержавшийсяКандидат.Кандидат = Выборка.Кандидат;
			ЗадержавшийсяКандидат.ДнейДоступно = ДнейДоступно;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьКандидатовДляПредупреждения(ЗадержавшиесяКандидаты, ДанныеЗадержкиПоЭтапам, Выборка, ДнейДоступно, ТекущаяДата)
	
	Пока Выборка.СледующийПоЗначениюПоля("Кандидат") Цикл
		Если ТипЗнч(Выборка.ЭтапРаботы) = Тип("СправочникСсылка.ЭтапыРаботыСкандидатами") Тогда
			ДанныеЗадержкиПоЭтапу = ДанныеЗадержкиПоЭтапам.НайтиСтроки(Новый Структура("Ссылка", Выборка.ЭтапРаботы));
			Если ДанныеЗадержкиПоЭтапу.Количество() = 0 Или Не ДанныеЗадержкиПоЭтапу[0].ПроверятьКандидатовНаЗадержку Тогда
				Продолжить;
			ИначеЕсли ДанныеЗадержкиПоЭтапу[0].СпособПроверкиКандидатовНаЗадержку =
				Перечисления.СпособыОпределенияЗадержкиКандидатов.КакЗаданоВЭтапе Тогда
				ДнейДоступно = ДанныеЗадержкиПоЭтапу[0].ДнейДоСообщения;
			КонецЕсли;
		КонецЕсли;
		Если (НачалоДня(ТекущаяДата) - НачалоДня(Выборка.ДатаЭтапа)) / (60 * 60 * 24) > ДнейДоступно Тогда
			ЗадержавшийсяКандидат = ЗадержавшиесяКандидаты.Добавить();
			ЗадержавшийсяКандидат.Кандидат = Выборка.Кандидат;
			ЗадержавшийсяКандидат.ДнейДоступно = ДнейДоступно;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Параметры:
//  СовпадающиеДанные - Массив из СтрокаТаблицыЗначений
//  ИмяКолонки - Строка
// 
// Возвращаемое значение:
//  Строка
Функция ЗначенияИзКолонкиСовпадающихДанныхСтрокой(СовпадающиеДанные, ИмяКолонки)
	
	Значения = ОбщегоНазначения.ВыгрузитьКолонку(СовпадающиеДанные, ИмяКолонки);
	Результат = СтрСоединить(Значения, ",");
	
	Возврат Результат;
	
КонецФункции

Функция УточнениеПроблемыДублейЛичныхДанныхКандидата(СовпадающиеДанные)
	
	УточнениеПроблемы = НСтр("ru = 'Личные данные кандидата не уникальны ('");
	Для Каждого ТекущиеДанные Из СовпадающиеДанные Цикл
		УточнениеПроблемы = УточнениеПроблемы + СтрШаблон(НСтр("ru = '%1:%2,'"), ТекущиеДанные.ОбластьПоиска,
			ТекущиеДанные.Значение);
	КонецЦикла;
	СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(УточнениеПроблемы);
	УточнениеПроблемы = УточнениеПроблемы + ")";
	
	Возврат УточнениеПроблемы;
	
КонецФункции

Функция ВажностьПроблемыДублей(СовпадающиеДанные)
	
	ОбластьПоискаОшибка = Новый Массив;
	ОбластьПоискаОшибка.Добавить("Почта");
	ОбластьПоискаОшибка.Добавить("Телефон");
	
	ВажностьПроблемы = Перечисления["ВажностьПроблемыУчета"].ПустаяСсылка();
	Для Каждого ТекущиеДанные Из СовпадающиеДанные Цикл
		Если ОбластьПоискаОшибка.Найти(ТекущиеДанные.ОбластьПоиска) <> Неопределено Тогда
			ВажностьПроблемы = Перечисления["ВажностьПроблемыУчета"].Ошибка;
			Прервать;
		ИначеЕсли ТекущиеДанные.ОбластьПоиска = "ФИО" Тогда
			ВажностьПроблемы = Перечисления["ВажностьПроблемыУчета"].Предупреждение;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ВажностьПроблемы;
	
КонецФункции

#КонецОбласти

#КонецЕсли
